pressure_tests_results/with_redis_random_files_2.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: pressureTest.js
     output: -

  scenarios: (100.00%) 1 scenario, 50 max VUs, 50s max duration (incl. graceful stop):
           * default: 50 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 50/50 VUs, 382 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  01.0s/20s

running (02.0s), 50/50 VUs, 813 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  02.0s/20s

running (03.0s), 50/50 VUs, 1216 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  03.0s/20s

running (04.0s), 50/50 VUs, 1665 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  04.0s/20s

running (05.0s), 50/50 VUs, 2090 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  05.0s/20s

running (06.0s), 50/50 VUs, 2534 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  06.0s/20s

running (07.0s), 50/50 VUs, 2969 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  07.0s/20s

running (08.0s), 50/50 VUs, 3419 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  08.0s/20s

running (09.0s), 50/50 VUs, 3859 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  09.0s/20s

running (10.0s), 50/50 VUs, 4303 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  10.0s/20s

running (11.0s), 50/50 VUs, 4760 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  11.0s/20s

running (12.0s), 50/50 VUs, 5196 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  12.0s/20s

running (13.0s), 50/50 VUs, 5642 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  13.0s/20s

running (14.0s), 50/50 VUs, 6078 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  14.0s/20s

running (15.0s), 50/50 VUs, 6500 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  15.0s/20s

running (16.0s), 50/50 VUs, 6947 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  16.0s/20s

running (17.0s), 50/50 VUs, 7392 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  17.0s/20s

running (18.0s), 50/50 VUs, 7837 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  18.0s/20s

running (19.0s), 50/50 VUs, 8273 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  19.0s/20s

running (20.0s), 50/50 VUs, 8720 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  20.0s/20s

running (20.1s), 00/50 VUs, 8772 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  20s

     data_received..................: 1.8 GB 89 MB/s
     data_sent......................: 1.1 MB 56 kB/s
     http_req_blocked...............: avg=12.11µs  min=0s       med=1µs     max=2.4ms    p(90)=2µs     p(95)=3µs     
     http_req_connecting............: avg=7.42µs   min=0s       med=0s      max=1.53ms   p(90)=0s      p(95)=0s      
     http_req_duration..............: avg=13.98ms  min=199µs    med=11.73ms max=116.55ms p(90)=26.83ms p(95)=32.45ms 
       { expected_response:true }...: avg=14.36ms  min=199µs    med=11.96ms max=116.55ms p(90)=27.09ms p(95)=32.89ms 
     http_req_failed................: 12.30% ✓ 1079       ✗ 7693
     http_req_receiving.............: avg=188.04µs min=5µs      med=31µs    max=96.91ms  p(90)=130µs   p(95)=169µs   
     http_req_sending...............: avg=7.45µs   min=2µs      med=4µs     max=7.14ms   p(90)=9µs     p(95)=13.44µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=13.78ms  min=188µs    med=11.65ms max=114.81ms p(90)=26.64ms p(95)=32.19ms 
     http_reqs......................: 8772   436.255085/s
     iteration_duration.............: avg=114.33ms min=100.26ms med=112.1ms max=219.43ms p(90)=127.2ms p(95)=133.02ms
     iterations.....................: 8772   436.255085/s
     vus............................: 50     min=50       max=50
     vus_max........................: 50     min=50       max=50