pressure_tests_results/with_redis_random_files_3.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: pressureTest.js
     output: -

  scenarios: (100.00%) 1 scenario, 50 max VUs, 50s max duration (incl. graceful stop):
           * default: 50 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 50/50 VUs, 374 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  01.0s/20s

running (02.0s), 50/50 VUs, 796 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  02.0s/20s

running (03.0s), 50/50 VUs, 1216 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  03.0s/20s

running (04.0s), 50/50 VUs, 1664 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  04.0s/20s

running (05.0s), 50/50 VUs, 2111 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  05.0s/20s

running (06.0s), 50/50 VUs, 2551 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  06.0s/20s

running (07.0s), 50/50 VUs, 2993 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  07.0s/20s

running (08.0s), 50/50 VUs, 3438 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  08.0s/20s

running (09.0s), 50/50 VUs, 3881 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  09.0s/20s

running (10.0s), 50/50 VUs, 4334 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  10.0s/20s

running (11.0s), 50/50 VUs, 4765 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  11.0s/20s

running (12.0s), 50/50 VUs, 5225 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  12.0s/20s

running (13.0s), 50/50 VUs, 5669 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  13.0s/20s

running (14.0s), 50/50 VUs, 6104 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  14.0s/20s

running (15.0s), 50/50 VUs, 6550 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  15.0s/20s

running (16.0s), 50/50 VUs, 6986 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  16.0s/20s

running (17.0s), 50/50 VUs, 7438 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  17.0s/20s

running (18.0s), 50/50 VUs, 7886 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  18.0s/20s

running (19.0s), 50/50 VUs, 8334 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  19.0s/20s

running (20.0s), 50/50 VUs, 8770 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  20.0s/20s

running (20.1s), 00/50 VUs, 8821 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  20s

     data_received..................: 1.8 GB 91 MB/s
     data_sent......................: 1.1 MB 56 kB/s
     http_req_blocked...............: avg=11.95µs  min=0s       med=1µs      max=2.94ms   p(90)=2µs      p(95)=3µs     
     http_req_connecting............: avg=7.17µs   min=0s       med=0s       max=1.44ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=13.36ms  min=217µs    med=10.79ms  max=114.33ms p(90)=27.88ms  p(95)=33.43ms 
       { expected_response:true }...: avg=13.58ms  min=217µs    med=10.99ms  max=114.33ms p(90)=28.01ms  p(95)=33.55ms 
     http_req_failed................: 12.62% ✓ 1114       ✗ 7707
     http_req_receiving.............: avg=185.71µs min=5µs      med=29µs     max=91.86ms  p(90)=118µs    p(95)=149µs   
     http_req_sending...............: avg=5.52µs   min=2µs      med=4µs      max=332µs    p(90)=8µs      p(95)=12µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=13.16ms  min=204µs    med=10.7ms   max=107.62ms p(90)=27.7ms   p(95)=33.24ms 
     http_reqs......................: 8821   438.719391/s
     iteration_duration.............: avg=113.67ms min=100.28ms med=111.11ms max=218.64ms p(90)=128.28ms p(95)=133.83ms
     iterations.....................: 8821   438.719391/s
     vus............................: 50     min=50       max=50
     vus_max........................: 50     min=50       max=50