pressure_tests_results/with_redis_random_files_4.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: pressureTest.js
     output: -

  scenarios: (100.00%) 1 scenario, 50 max VUs, 50s max duration (incl. graceful stop):
           * default: 50 looping VUs for 20s (gracefulStop: 30s)


running (01.0s), 50/50 VUs, 320 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  01.0s/20s

running (02.0s), 50/50 VUs, 723 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  02.0s/20s

running (03.0s), 50/50 VUs, 1167 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  03.0s/20s

running (04.0s), 50/50 VUs, 1608 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  04.0s/20s

running (05.0s), 50/50 VUs, 2032 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  05.0s/20s

running (06.0s), 50/50 VUs, 2446 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  06.0s/20s

running (07.0s), 50/50 VUs, 2880 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  07.0s/20s

running (08.0s), 50/50 VUs, 3315 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  08.0s/20s

running (09.0s), 50/50 VUs, 3740 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  09.0s/20s

running (10.0s), 50/50 VUs, 4170 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  10.0s/20s

running (11.0s), 50/50 VUs, 4590 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  11.0s/20s

running (12.0s), 50/50 VUs, 5013 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  12.0s/20s

running (13.0s), 50/50 VUs, 5446 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  13.0s/20s

running (14.0s), 50/50 VUs, 5894 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  14.0s/20s

running (15.0s), 50/50 VUs, 6346 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  15.0s/20s

running (16.0s), 50/50 VUs, 6778 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  16.0s/20s

running (17.0s), 50/50 VUs, 7169 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  17.0s/20s

running (18.0s), 50/50 VUs, 7599 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  18.0s/20s

running (19.0s), 50/50 VUs, 8029 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  19.0s/20s

running (20.0s), 50/50 VUs, 8458 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  20.0s/20s

running (20.1s), 00/50 VUs, 8510 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  20s

     data_received..................: 1.8 GB 90 MB/s
     data_sent......................: 1.1 MB 54 kB/s
     http_req_blocked...............: avg=11.24µs  min=0s       med=1µs      max=2.34ms   p(90)=3µs      p(95)=4µs     
     http_req_connecting............: avg=7.14µs   min=0s       med=0s       max=1.48ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=17.38ms  min=216µs    med=14.07ms  max=164.38ms p(90)=34.71ms  p(95)=44.28ms 
       { expected_response:true }...: avg=17.64ms  min=216µs    med=14.39ms  max=164.38ms p(90)=34.89ms  p(95)=44.57ms 
     http_req_failed................: 12.27% ✓ 1045       ✗ 7465
     http_req_receiving.............: avg=224.17µs min=5µs      med=39µs     max=97.36ms  p(90)=135µs    p(95)=189µs   
     http_req_sending...............: avg=8.11µs   min=2µs      med=4µs      max=3.4ms    p(90)=10µs     p(95)=16µs    
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=17.15ms  min=203µs    med=13.99ms  max=121.15ms p(90)=34.63ms  p(95)=43.77ms 
     http_reqs......................: 8510   423.452059/s
     iteration_duration.............: avg=117.8ms  min=100.28ms med=114.45ms max=265.07ms p(90)=135.16ms p(95)=144.77ms
     iterations.....................: 8510   423.452059/s
     vus............................: 50     min=50       max=50
     vus_max........................: 50     min=50       max=50